sochange_files/sochange/sochange/sochange/app/controllers/missions_controller.rb

  def index
    @missions = Mission.all
---
SELECT * FROM `missions`

  def show
    @mission = Mission.find(params[:id])
---
SELECT * FROM `missions` WHERE (`missions`.`id` = 1)

  def edit
    @mission = Mission.find(params[:id])
---
SELECT * FROM `missions` WHERE (`missions`.`id` = 1)

  def create
    @mission = Mission.new(params[:mission])

    respond_to do |format|
      if @mission.save
---
INSERT INTO `missions` (`name`, `created_at`, `short_description`, `updated_at`, `long_description`) VALUES('Support Local Cambridge Businesses', '2010-04-20 17:49:05', 'Suppor the businesses that create jobs and give the most back to our community by buying local.', '2010-04-20 17:49:05', 'This is a very long description.')

  def update
    @mission = Mission.find(params[:id])

    respond_to do |format|
      if @mission.update_attributes(params[:mission])
---
SELECT * FROM `missions` WHERE (`missions`.`id` = 1)
UPDATE `missions` SET `updated_at` = '2010-04-20 19:09:42', `long_description` = 'Suppor the businesses that create jobs and give the most back to our community by buying local.Suppor the businesses that create jobs and give the most back to our community by buying local.Suppor the businesses that create jobs and give the most back to our community by buying local.Suppor the businesses that create jobs and give the most back to our community by buying local.Suppor the businesses that create jobs and give the most back to our community by buying local.Suppor the businesses that create jobs and give the most back to our community by buying local.Suppor the businesses that create jobs and give the most back to our community by buying local.Suppor the businesses that create jobs and give the most back to our community by buying local.Suppor the businesses that create jobs and give the most back to our community by buying local.Suppor the businesses that create jobs and give the most back to our community by buying local.Suppor the businesses that create jobs and give the most back to our community by buying local.' WHERE `id` = 1