sochange_files/sochange/sochange/sochange/app/controllers/profiles_controller.rb

  def index
    @profiles = Profile.all
---
SELECT * FROM `profiles`